--- a/src/content/docs/homelab/hardware/network.md
+++ b/src/content/docs/homelab/hardware/network.md
@@ -12,20 +12,21 @@ The following devices are powering the network for my homelab:
 | UniFi nanoHD                                   | Wireless access point.                                                                                                        |
 | UniFi Standard 24-port PoE Switch (USW-24-POE) | Switch for all ethernet devices.                                                                                              |
 
-```mermaid
-graph TD
-    bell["Bell Aliant (ISP)"]
-    homehub["Bell Home Hub 3000 (Sagemcom F@st 5566)"]
-    udmpro["UniFi Dream Machine Pro"]
-    nanohd["UniFi nanoHD"]
-    usw24["UniFi Standard 24-port PoE Switch (USW-24-POE)"]
-    ethernet_clients["Ethernet Clients"]
-    wifi_clients["WiFi Clients"]
+```d2
+direction: down
 
-    bell-- Fibre -->homehub
-    homehub-- Ethernet -->udmpro
-    udmpro-- SFP+ Direct Connect -->usw24
-    usw24-- Ethernet -->nanohd
-    usw24-- Ethernet --> ethernet_clients
-    nanohd-- WiFi --> wifi_clients
+bell: "Bell Aliant (ISP)"
+homehub: "Bell Home Hub 3000 (Sagemcom F@st 5566)"
+udmpro: "UniFi Dream Machine Pro"
+nanohd: "UniFi nanoHD"
+usw24: "UniFi Standard 24-port PoE Switch (USW-24-POE)"
+ethernet_clients: "Ethernet Clients"
+wifi_clients: "WiFi Clients"
+
+bell -> homehub: Fibre
+homehub -> udmpro: Ethernet
+udmpro -> usw24: SFP+ Direct Connect
+usw24 -> nanohd: Ethernet
+usw24 -> ethernet_clients: Ethernet
+nanohd -> wifi_clients: WiFi
 ```
